In [1]:
import pandas as pd
import datetime
import os
os.getcwd()

'/home/jian/BigLots/MediaStorm_2019-05-04'

In [20]:
daily_1124.head(2)

,location_id,transaction_dt,transaction_id,customer_id_hashed,class_code_id,subclass_id,item_id,item_transaction_units,item_transaction_amt
0,1671,2019-05-01,4114,c044127f7b4f5ce0e494f0200b97be309851269783476b...,61002,2,810231217,1,00000000000049.9900
1,5281,2019-05-01,8748,NaN,12012,12,810184344,1,00000000000001.5000

In [23]:
daily_1124=pd.read_csv("./MediaStormDailySales20190507-112411-800.txt",dtype=str,sep="|")
daily_1124['item_transaction_amt']=daily_1124['item_transaction_amt'].astype(float)

print(daily_1124['item_transaction_amt'].sum())

27491095.89

In [24]:
daily_1124.tail(5)

,location_id,transaction_dt,transaction_id,customer_id_hashed,class_code_id,subclass_id,item_id,item_transaction_units,item_transaction_amt
3413444,4282,2019-05-04,4860,NaN,17002,2,810349991,2,8.0
3413445,1797,2019-05-02,4956,21fb5d8240708b5819157e1125ffd6f171b1a2cb7a8990...,35046,3,810303866,2,7.0
3413446,5102,2019-05-01,694,NaN,15002,2,810229229,1,6.0
3413447,1848,2019-05-03,6379,e0f33f56163c374591cad7d078f9edc5efc36b53138135...,11008,15,810395157,1,1.9
3413448,5227,2019-05-03,1818,c,NaN,NaN,NaN,NaN,NaN

In [26]:
daily_1124[daily_1124['location_id']=="4564"]['item_transaction_amt'].sum()

18272.490000000002

In [27]:
daily_1130=pd.read_csv("./MediaStormDailySales20190507-113110-141.txt",dtype=str,sep="|")
daily_1130['item_transaction_amt']=daily_1130['item_transaction_amt'].astype(float)

print(daily_1130['item_transaction_amt'].sum())

103689562.45

In [36]:
daily_1130.tail(2)

,location_id,transaction_dt,transaction_id,customer_id_hashed,class_code_id,subclass_id,item_id,item_transaction_units,item_transaction_amt
12960076,1755,2019-05-04,61,0837ddb3dd9ffc20e2126ad20a6eeeee3169cd4cb24ce8...,47002,3,810348317,1,11.00
12960077,4660,2019-05-03,707,NaN,11007,11,810042583,1,1.75

In [28]:
daily_1130[daily_1130['location_id']=="4564"]['item_transaction_amt'].sum()

58152.199999999997

In [37]:
daily_1130['transaction_dt'].min()

'2019-04-28'

In [38]:
daily_1130['transaction_dt'].max()

'2019-05-04'

In [29]:
weekly_1130=pd.read_csv("./MediaStormSalesWeekly20190507-113010-717.txt",dtype=str,sep="|")
weekly_1130.head(2)

,location_id,week_end_dt,fiscal_week_nbr,gross_sales_amt,gross_transaction_cnt,class_code_id,subclass_id,subclass_gross_sales_amt
0,1,2019-05-04,13,0000000000083265.69,2232,11001,2,0000000000000431.73
1,1,2019-05-04,13,0000000000083265.69,2232,11001,4,0000000000000051.78

In [31]:
weekly_1130=pd.read_csv("./MediaStormSalesWeekly20190507-113010-717.txt",dtype=str,sep="|")
weekly_1130['subclass_gross_sales_amt']=weekly_1130['subclass_gross_sales_amt'].astype(float)

print(weekly_1130['subclass_gross_sales_amt'].sum())

103685150.14

In [32]:
weekly_1130['week_end_dt'].min()

'2019-05-04'

In [33]:
weekly_1130['week_end_dt'].max()

'2019-05-04'